results/raw/direct_extended_tlsFalse_c64.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: extended
number of clients: 64
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1687972
number of failed transactions: 0 (0.000%)
latency average = 6.821 ms
latency stddev = 7.840 ms
initial connection time = 48.823 ms
tps = 9378.425745 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 9160.4 tps, lat 6.945 ms stddev 8.114, 0 failed
progress: 20.0 s, 9413.5 tps, lat 6.795 ms stddev 7.641, 0 failed
progress: 30.0 s, 9492.6 tps, lat 6.741 ms stddev 7.556, 0 failed
progress: 40.0 s, 9492.3 tps, lat 6.739 ms stddev 7.511, 0 failed
progress: 50.0 s, 9511.5 tps, lat 6.726 ms stddev 7.607, 0 failed
progress: 60.0 s, 8989.1 tps, lat 7.117 ms stddev 8.365, 0 failed
progress: 70.0 s, 9295.4 tps, lat 6.883 ms stddev 8.332, 0 failed
progress: 80.0 s, 9533.6 tps, lat 6.711 ms stddev 7.671, 0 failed
progress: 90.0 s, 9477.1 tps, lat 6.750 ms stddev 7.707, 0 failed
progress: 100.0 s, 9488.5 tps, lat 6.738 ms stddev 7.481, 0 failed
progress: 110.0 s, 9406.0 tps, lat 6.806 ms stddev 7.926, 0 failed
progress: 120.0 s, 9524.0 tps, lat 6.719 ms stddev 7.684, 0 failed
progress: 130.0 s, 9406.6 tps, lat 6.800 ms stddev 7.953, 0 failed
progress: 140.0 s, 9447.5 tps, lat 6.769 ms stddev 7.632, 0 failed
progress: 150.0 s, 9230.6 tps, lat 6.929 ms stddev 7.990, 0 failed
progress: 160.0 s, 9184.0 tps, lat 6.970 ms stddev 8.051, 0 failed
progress: 170.0 s, 9420.8 tps, lat 6.789 ms stddev 7.699, 0 failed
progress: 180.0 s, 9318.4 tps, lat 6.864 ms stddev 8.150, 0 failed