results/raw/direct_prepared_tlsTrue_c128.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: prepared
number of clients: 128
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1628630
number of failed transactions: 0 (0.000%)
latency average = 14.135 ms
latency stddev = 20.592 ms
initial connection time = 119.801 ms
tps = 9051.252828 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 8683.2 tps, lat 14.526 ms stddev 21.431, 0 failed
progress: 20.0 s, 8963.5 tps, lat 14.282 ms stddev 21.037, 0 failed
progress: 30.0 s, 8969.3 tps, lat 14.267 ms stddev 20.984, 0 failed
progress: 40.0 s, 9070.5 tps, lat 14.094 ms stddev 20.936, 0 failed
progress: 50.0 s, 9094.9 tps, lat 14.078 ms stddev 20.450, 0 failed
progress: 60.0 s, 8803.5 tps, lat 14.527 ms stddev 21.366, 0 failed
progress: 70.0 s, 8965.9 tps, lat 14.288 ms stddev 20.272, 0 failed
progress: 80.0 s, 9131.4 tps, lat 14.010 ms stddev 20.081, 0 failed
progress: 90.0 s, 9078.8 tps, lat 14.092 ms stddev 20.808, 0 failed
progress: 100.0 s, 9121.8 tps, lat 14.021 ms stddev 19.866, 0 failed
progress: 110.0 s, 9163.6 tps, lat 13.969 ms stddev 20.104, 0 failed
progress: 120.0 s, 9289.5 tps, lat 13.787 ms stddev 20.012, 0 failed
progress: 130.0 s, 9329.2 tps, lat 13.705 ms stddev 18.962, 0 failed
progress: 140.0 s, 9184.5 tps, lat 13.936 ms stddev 20.219, 0 failed
progress: 150.0 s, 9166.7 tps, lat 13.969 ms stddev 19.934, 0 failed
progress: 160.0 s, 8745.4 tps, lat 14.628 ms stddev 22.109, 0 failed
progress: 170.0 s, 9053.0 tps, lat 14.134 ms stddev 20.417, 0 failed
progress: 180.0 s, 9036.9 tps, lat 14.160 ms stddev 21.554, 0 failed