results/raw/direct_simple_tlsFalse_c16.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 16
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1498063
number of failed transactions: 0 (0.000%)
latency average = 1.922 ms
latency stddev = 0.969 ms
initial connection time = 13.426 ms
tps = 8322.915404 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 8279.3 tps, lat 1.930 ms stddev 0.960, 0 failed
progress: 20.0 s, 8457.5 tps, lat 1.891 ms stddev 0.928, 0 failed
progress: 30.0 s, 8540.0 tps, lat 1.873 ms stddev 0.925, 0 failed
progress: 40.0 s, 8408.9 tps, lat 1.902 ms stddev 0.972, 0 failed
progress: 50.0 s, 8355.4 tps, lat 1.915 ms stddev 0.961, 0 failed
progress: 60.0 s, 8338.2 tps, lat 1.919 ms stddev 0.969, 0 failed
progress: 70.0 s, 8366.1 tps, lat 1.912 ms stddev 0.966, 0 failed
progress: 80.0 s, 8150.4 tps, lat 1.963 ms stddev 0.995, 0 failed
progress: 90.0 s, 7723.6 tps, lat 2.071 ms stddev 1.097, 0 failed
progress: 100.0 s, 8281.5 tps, lat 1.932 ms stddev 0.993, 0 failed
progress: 110.0 s, 8290.4 tps, lat 1.930 ms stddev 0.969, 0 failed
progress: 120.0 s, 8350.7 tps, lat 1.916 ms stddev 0.960, 0 failed
progress: 130.0 s, 8279.8 tps, lat 1.932 ms stddev 0.986, 0 failed
progress: 140.0 s, 8378.8 tps, lat 1.909 ms stddev 0.951, 0 failed
progress: 150.0 s, 8319.9 tps, lat 1.923 ms stddev 0.964, 0 failed
progress: 160.0 s, 8440.0 tps, lat 1.895 ms stddev 0.960, 0 failed
progress: 170.0 s, 8432.3 tps, lat 1.897 ms stddev 0.941, 0 failed
progress: 180.0 s, 8410.2 tps, lat 1.902 ms stddev 0.941, 0 failed