results/raw/pgbouncer_extended_tlsFalse_c128.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: extended
number of clients: 128
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 731418
number of failed transactions: 0 (0.000%)
latency average = 31.500 ms
latency stddev = 3.542 ms
initial connection time = 11.814 ms
tps = 4062.861666 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 4021.9 tps, lat 31.737 ms stddev 3.845, 0 failed
progress: 20.0 s, 4278.8 tps, lat 29.915 ms stddev 3.153, 0 failed
progress: 30.0 s, 4137.7 tps, lat 30.932 ms stddev 3.826, 0 failed
progress: 40.0 s, 4077.3 tps, lat 31.396 ms stddev 3.113, 0 failed
progress: 50.0 s, 3987.4 tps, lat 32.102 ms stddev 3.382, 0 failed
progress: 60.0 s, 4027.8 tps, lat 31.774 ms stddev 3.533, 0 failed
progress: 70.0 s, 3939.8 tps, lat 32.494 ms stddev 3.209, 0 failed
progress: 80.0 s, 3881.4 tps, lat 32.968 ms stddev 4.051, 0 failed
progress: 90.0 s, 4125.0 tps, lat 31.027 ms stddev 3.561, 0 failed
progress: 100.0 s, 4075.8 tps, lat 31.417 ms stddev 4.211, 0 failed
progress: 110.0 s, 4160.5 tps, lat 30.755 ms stddev 3.471, 0 failed
progress: 120.0 s, 3971.4 tps, lat 32.234 ms stddev 3.434, 0 failed
progress: 130.0 s, 4013.6 tps, lat 31.890 ms stddev 3.244, 0 failed
progress: 140.0 s, 4000.9 tps, lat 31.991 ms stddev 2.889, 0 failed
progress: 150.0 s, 3991.5 tps, lat 32.067 ms stddev 3.397, 0 failed
progress: 160.0 s, 4211.4 tps, lat 30.394 ms stddev 3.189, 0 failed
progress: 170.0 s, 4127.5 tps, lat 31.007 ms stddev 3.423, 0 failed
progress: 180.0 s, 4099.7 tps, lat 31.218 ms stddev 3.117, 0 failed