results/raw/proxysql_basic_prepared_tlsFalse_c1.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 20037
number of failed transactions: 0 (0.000%)
latency average = 0.920 ms
latency stddev = 0.106 ms
initial connection time = 12.127 ms
tps = 1086.620233 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 1055.5 tps, lat 0.946 ms stddev 0.123, 0 failed
pgbench: error: client 0 aborted in command 5 (SQL) of script 0; perhaps the backend died while processing
pgbench: error: Run was aborted; the above results are incomplete.