results/raw/proxysql_basic_prepared_tlsTrue_c1.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 14052
number of failed transactions: 0 (0.000%)
latency average = 1.305 ms
latency stddev = 0.132 ms
initial connection time = 15.471 ms
tps = 766.184168 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 779.6 tps, lat 1.280 ms stddev 0.161, 0 failed
pgbench: error: client 0 aborted in command 5 (SQL) of script 0; perhaps the backend died while processing
pgbench: error: Run was aborted; the above results are incomplete.